/*
 Localizable.strings
 client_ios_fm_a
 
 Created by 杨帆 on 16/2/1.
 Copyright © 2016年 flynn. All rights reserved.
 */
{
    
    //公用
    "input_capacity_format" = "You can enter %ld words at max.";
    "input_capacity_format_reset" = "You can still enter %ld words at max.";
    
    "btn_title_ok" = "Confirm";
    "btn_title_cancel" = "Cancel";
    
    "btn_title_i_know" = "I know";
    "btn_title_no" = "No";
    "btn_title_all_right" = "All right.";
    "btn_title_yes" = "Yes";
    "btn_title_wait" = "Hold on";
    
    "btn_title_current_month" = "%d-%d";
    "btn_title_current_month_format" = "YYYY-MM";
    "btn_title_next_month" = "Next";
    "btn_title_previous_month" = "Previous";
    
    "btn_title_next_item" = "Next";
    "btn_title_previous_item" = "Previous";
    
    "btn_title_add" = "Add";
    "btn_title_edit" = "Update";
    "btn_title_save" = "Save";
    "btn_title_hold" = "Hold";
    "btn_title_finish" = "Complete";
    "btn_title_finish_all" = "Complete All";
    
    "btn_title_reset" = "Reset";
    "btn_title_upload" = "Upload";
    "btn_title_upload_all" = "Upload All";
    "btn_title_delete" = "Delete";
    "btn_title_enable" = "Enable";
    "btn_title_disable" = "Disable";
    "btn_title_filter" = "Filter";
    "btn_title_submit" = "Submit";
    "btn_title_revoke" = "Revoke";
    "btn_title_clean" = "Clean";
    
    "number_one" = "One";
    "number_two" = "Two";
    "number_three" = "Three";
    "number_four" = "Four";
    "number_five" = "Five";
    "number_six" = "Six";
    "number_seven" = "Seven";
    "number_eight" = "Eight";
    "number_nine" = "Nine";
    "number_ten" = "Ten";
    
    "notice_title_info" = "Tips";
    
    "loading" = "Loading...";
    "load_fail" = "Loading failed";
    "requesting" = "Waiting...";
    "input_here" = "Enter Message";
    
    "please_wait" = "Developing...";
    
    "no_more_data" = "No More data";
    
    "photo_count_format" = "Total %ld";
    "audio_count_format" = "Total %ld";
    "cost_submit" = "Total:";
    
    "unknow" = "Unknow";
    "time_start" = "Start Time";
    "time_end" = "End Time";
    "time_start_estimate" = "Start Time:";
    "time_end_estimate" = "End Time:";
    "time_create" = "Create Date:";
    "time_arrival" = "Arrival Time";
    "time_completion" = "Completion Time";
    
    "yuan" = "Yuan";
    "yuan_symbol" = "￥";
    
    "meter" = "m";
    
    "take_camera" = "Take A Photo";
    "pick_from_album" = "Choose From Photos";
    
    "label_desc" = "Description:";
    "label_note" = "Note:";
    "start_to_use" = "Start to Use";
    "select_no_data" = "No Data";
    "select_no_project" = "No Project";
    
    "year" = "year";
    "month" = "month";
    
    //weekday
    "sunday" = "Sun";
    "saturday" = "Sat";
    "friday" = "Fri";
    "thursday" = "Thu";
    "wednesday" = "Wed";
    "tuesday" = "Tue";
    "monday" = "Mon";
    
    //通知
    "notification_need_login" = "Please log in.";
    
    //登陆页面
    "login_btn_title" = "Login";
    "login_username" = "User Name";
    "login_password" = "Password";
    "login_input_server_address" = "Please enter the server address";
    "login_server_address_format" = "The format of the address is error. Try again please.";
    "login_fail" = "Login Failed.";
    "login_notice_remember_password" = "Login successfully, whether to remember the password?";
    "login_notice_request_serverid_failed" = "Failed to request server ID.";
    
    //项目切换
    "project_exchange_search_notice" = "project info here (eg. 创新园, cxy)";
    "project_current_key" = "Cur";
    "project_current_key_full" = "Current";
    
    //Main
    "tabbar_task" = "Task";
    "tabbar_function" = "Function";
    "tabbar_user" = "User";
    "tabbar_chart" = "Report";
    "tabbar_me" = "User";
    "tabbar_messages" = "Messages";
    
    //任务
    "task_no_tasks" = "No Data";
    "task_view_more" = "More Data";
    
    //功能
    "function_order" = "Work Order";
    "function_order_undo" = "Uncompleted";
    "function_order_query" = "History";
    "function_order_dispach" = "Unassigned";
    "function_order_approval" = "Unapproved";
    "function_order_grab" = "Grabing";
    "function_order_grabed" = "Grabed";
    "function_order_validate" = "Verifying";
    "function_order_close" = "Archive";
    "function_order_approval_request" = "Apply for Approving";
    
    "function_order_detail_tool" = "Tools";
    "function_order_detail_material" = "Material";
    "function_order_detail_equipment" = "Equipment";
    "function_order_detail_step" = "Maintenance Step";
    "function_order_detail_cost" = "Charge Details";
    "function_order_detail_history" = "History Record";
    
    "function_patrol" = "Patrol";
    "function_patrol_task" = "Inspection Task";
    "function_patrol_query" = "Inspection History";
    "function_patrol_record_edit" = "Enter Records";
    "function_patrol_scanner" = "Scan QR Code";
    "function_patrol_spot_list" = "Tasks Of Spot";
    
    
    "patrol_notice_no_tasks" = "No tasks";
    "patrol_notice_spot_error" = "Spot coding error";
    
    
    "function_maintenance" = "Maintenance";
    "function_asset" = "Asset";
    "function_report" = "New Request";
    "function_report_detail" = "Fault Detail";
    "function_report_un_uploaded" = "Not upload";
    "function_report_uploaded" = "Submit";
    "function_reset_password" = "Reset Password";
    "function_outline_download" = "Offline Download";
    "function_setting_feedback" = "Feedback";
    "function_setting_about" = "About";
    "function_setting_legal" = "Legal Declaration";
    "function_bind_phone" = "Register Phone Number";
    "function_chart" = "Chart";
    "function_emergency" = "Emergency";
    "function_due_remind" = "Expire";
    "function_info_select" = "Select";
    "function_info_select_laborer" = "Select Executor";
    "function_info_select_approver" = "Approver";
    "function_info_select_location" = "Location";
    "function_info_select_department" = "Department";
    "function_info_select_service_type" = "Service Type";
    "function_info_select_order_type" = "Order Type";
    "function_info_select_priority" = "Priority";
    "function_info_select_equipment" = "Equipment";
    "function_info_select_inventory" = "Inventory";
    "function_info_select_material" = "Material";
    "function_info_select_requirement" = "Requirement Type";
    "function_info_select_title_material" = "Material";
    
    "function_select_project" = "Project Select";
    
    "function_qrcode" = "QR code";
    
    "function_attendance" = "Sign";
    
    "function_requirement" = "Requirement";
    "function_inventory" = "Inventory";
    "function_library" = "Library";
    "function_energy" = "Energy";
    "function_energy_second_title" = "Energy Management";
    
    "function_setting" = "Setting";
    "function_setting_cache" = "Clear Cache";
    "function_setting_notification" = "Notification";
    "function_notification_alert" = "New Message Alert";
    
    "function_my_report" = "My Report";
    "function_my_requirement" = "My Requirement";
    
    "function_requirement_create" = "Create";
    "function_requirement_approval" = "Unapproved";
    "function_requirement_undo" = "Uncompleted";
    "function_requirement_evaluate" = "Unevaluated";
    "function_requirement_query" = "History";
    "function_requirement_detail" = "Requirement Details";
    "function_requirement_content" = "Content";
    "function_requirement_detail_evaluate" = "Evaluate";
    
    "function_video_create" = "Video Recording";
    "function_media_play" = "Video Playing";
    
    "function_inventory" = "Inventory";
    "function_inventory_reserve" = "Reserve";
    "function_inventory_reserved" = "My Reserved";
    "function_inventory_approval" = "Unapproved";
    "function_inventory_history" = "History";
    
    "function_inventory_storage_in" = "Storage In";
    "function_inventory_storage_out" = "Storage Out";
    "function_inventory_storage_move" = "Storage Move";
    "function_inventory_storage_count" = "Storage Check";
    
    "function_inventory_reserve_detail" = "Reservation Detail";
    "function_inventory_material" = "Material";
    
    "function_inventory_delivery_material_detail" = "Out Adjust";
    "function_inventory_reserve_material_detail" = "Material Details";
    "function_inventory_move_material_detail" = "Material Details";
    "function_inventory_select_provider" = "Select Provider";
    
    
    //公告，告示
    "function_notice" = "Notice";
    
    //合同
    "function_contract" = "Contract";
    "function_contract_process" = "Management";
    "function_contract_query" = "Query";
    "function_contract_detail" = "Contract Details";
    "function_contract_statistics" = "Statistics";
    
    
    //我的
    "user_telno" = "Phone Number";
    "user_my_attendance_record" = "My Attendance";
    "user_my_qrcode" = "My QRCode";
    "user_reset_password" = "Reset Password";
    "user_outline_download" = "Offline Download";
    "user_feedback" = "Feedback";
    "user_about" = "About";
    "user_logout" = "Log Out";
    "user_logout_notice" = "Make sure to exit?";
    "user_btn_logout" = "Log Out";
    
    //消息
    "message_no_data" = "No More Messages";
    "message_time_format_morning" = "%@%ld:%@%ld AM";
    "message_time_format_afternoon" = "%@%ld:%@%ld PM";
    "message_time_format_24" = "%@%ld:%@%ld";
    "message_yestarday" = "Yesterday";
    "message_tomorrow" = "Tomorrow";
    "message_date_format" = "%ld-%ld";
    
    //
    "fast_scan_spot" = "Spot Scan";
    "fast_scan_equipment" = "Equipment Scan";
    
    //工作
    "main_notice_no_function" = "No Permission";
    
    //巡检
    "patrol_no_tasks" = "No data";
    "patrol_spot_qrcode_error" = "Qrcode exception.";
    "patrol_submit_success" = "Data upload successfully.";
    "patrol_submit_fail" = "Data upload failed.";
    "patrol_notice_unfinished_some" = "Whether submit or not? You still have %d inspection items uncompleted.";
    "patrol_notice_unfinished" = "Whether submit or not? You still some spot items uncompleted.";
    "patrol_task" = "Inspection Task";
    "patrol_request_fail" = "Fail to get data.";
    "patrol_no_task_current" = "No more inspection tasks.";
    "patrol_btn_submit" = "Submit";
    "patrol_load_fail" = "Fail to load task.";
    
    "patrol_btn_all" = "All";
    "patrol_btn_finished" = "Completed";
    "patrol_btn_unfinished" = "Uncompleted";
    "patrol_menu_syn" = "Sync";
    "patrol_no_data_syn" = "No need to synchronize the data locally.";
    "patrol_no_spot" = "No Spot.";
    "patrol_no_spot_finished" = "No Completed Spot.";
    "patrol_no_spot_unfinished" = "No Uncompleted Spot.";
    
    "patrol_query" = "Inspection History";
    "patrol_no_history" = "No data";
    
    "patrol_filter_name" = "Patrol Name";
    "patrol_filter_name_placeholder" = "Name";
    "patrol_filter_time" = "Patrol Time";
    "patrol_filter_time_start" = "Start Time";
    "patrol_filter_time_end" = "End Time";
    "patrol_filter_spot_status" = "Spot Status";
    "patrol_status_normal" = "Normal";
    "patrol_status_exception" = "Exception";
    "patrol_status_leak" = "Missed";
    "patrol_status_report" = "Repair";
    "patrol_status_fillup" = "Fill up";
    "patrol_time_start_behind_end" = "Completion time is earlier than arrival time.";
    
    "patrol_status_exception_processed" = "Solved";
    
    "patrol_detail" = "Inspection Detail";
    "patrol_comprehensive" = "Comprehensive Inspection";
    "patrol_spot" = "Spot:";
    "patrol_spot_content" = "Inspection Works";
    "patrol_device_info" = "Equipment Info";
    "patrol_order_list" = "Work Order";
    "patrol_notice_report" = "Would you want to report now?";
    "patrol_notice_syned_success" = "Local data synchronization successfully.";
    "patrol_notice_syned_fail" = "Local data synchronizes failed.";
    "patrol_notice_qrcode_fail" = "Don't match,please confirm.";
    "patrol_spot_content_amount" = "Inspection Item:";
    "patrol_spot_amount" = "%d spot";
    "patrol_spot_amount_multi" = "%d spots";
    "patrol_comprehensive_amount" = "Synthetic:";
    "patrol_equipment_amount" = "Equipment:";
    "patrol_spot_location" = "Location:";
    
    "patrol_comprehensive_amount_format" = "%ld";
    "patrol_equipment_amount_foramt" = "%ld";
    
    "patrol_device" = "Spot Equipment";
    
    "patrol_task_status_begin" = "Uncompleted";
    "patrol_task_status_in_progress" = "In progress";
    "patrol_task_status_complete" = "Completed";
    "patrol_task_status_delay" = "Delayed";
    "patrol_task_status_incomplete" = "Uncompleted";
    
    "patrol_spot_not_begin" = "Uncompleted";
    "patrol_spot_normal" = "Completed";
    "patrol_spot_exception" = "Exception";
    "patrol_spot_not_finish" = "Uncompleted";
    "patrol_content_spot" = "spot:";
    "patrol_content_device" = "Equipment:";
    
    "patrol_syned" = "Synchronized";
    "patrol_un_syned" = "Not Synchronized";
    "patrol_laborer" = "Inspector:";
    "patrol_cycle" = "Frequency:";
    "patrol_time_estimate" = "Schedule Time:";
    "patrol_time_reality" = "Actual Time:";
    
    "patrol_equipment_name" = "Equipment Name";
    "patrol_equipment_system" = "Belongs to";
    "patrol_equipment_mark_stop" = "Stop";
    "patrol_equipment_mark_normal" = "Using";
    
    "patrol_equipment_status_operate_placeholder" = "Stop Or Not";
    "patrol_equipment_status_idle" = "Idle";
    "patrol_equipment_status_stop" = "Stopped";
    "patrol_equipment_status_using" = "Working";
    "patrol_equipment_status_repairing" = "Repairing";
    "patrol_equipment_status_scrap" = "Scrapped";
    "patrol_equipment_status_lock" = "Locked";
    "patrol_equipment_status_scraping" = "Scrapping";
    
    "patrol_notice_equipment_status_exception_format" = "Status of the equipment is %@, no need to process the content.";
    "patrol_notice_equipment_status_exception_stop" = "The equipment is stopped.";
    
    "patrol_content_result" = "Inspection Result";
    "patrol_check_result" = "Result";
    "patrol_content_desc" = "Work content";
    "patrol_question_desc" = "Problem Description";
    "patrol_relation_photos" = "Photo";
    
    "patrol_exception_common" = "Common Exception";
    "patrol_exception_place_holder" = "Please enter your records";
    "patrol_exception_no_data" = "No Common Exception";
    "patrol_exception_input_notice" = "Please enter your records";
    
    "patrol_item_operate" = "Solve";
    "patrol_item_operate_report" = "Report Fault";
    "patrol_item_operate_mark" = "Tag to solve";
    "patrol_item_operate_success" = "Request successfully.";
    "patrol_item_operate_fail" = "Request failed.";
    
    //工单
    "order_laborer_added" = "The executor has existed.";
    "order_approver_added" = "Already exist.";
    "order_time_start_behind_end" = "Completion time is earlier than start time.";
    "order_receive_success" = "Operate successfully.";
    "order_receive_fail" = "Operate failed.";
    "order_continue_success" = "Operate successfully.";
    "order_continue_fail" = "Operate failed.";
    "order_approval_success" = "Operate successfully.";
    "order_approval_fail" = "Operate failed.";
    "order_grab_success" = "Operate successfully.";
    "order_grab_fail" = "Operate failed.";
    "order_designate_principal" = "Responsible person has not been assigned,please confirm.";
    "order_laborer_empty" = "Confirm a laborer";
    
    
    "order_designate_approver" = "Please select an approver first.";
    "order_designate_arrive_time" = "Estimated time of arrival has not been specified, please confirm.";
    "order_dispach_success" = "Operate successfully.";
    "order_dispach_fail" = "Operate failed.";
    "order_terminate_success" = "Stop successfully.";
    "order_terminate_fail" = "Stop failed.";
    "order_back_success" = "Operate successfully.";
    "order_back_fail" = "Operate failed.";
    "order_pause_success" = "On hold successfully.";
    "order_pause_fail" = "On hold failed.";
    "order_save_success" = "Operate successfully.";
    "order_save_fail" = "Operate failed.";
    "order_finish_success" = "Operate successfully.";
    "order_finish_fail" = "Operate failed.";
    "order_validate_success" = "Operate successfully.";
    "order_validate_fail" = "Operate failed.";
    "order_close_success" = "Operate Successfully.";
    "order_close_fail" = "Operate failed.";
    "order_request_approval_success" = "Submit application success.";
    "order_request_approval_fail" = "Submit application failed.";
    
    "order_estimate_arrive_time" = "Estimate arrival time:";
    "order_estimate_time" = "Estimate Time:";
    "order_reserve_time" = "Reserve Time:";
    "order_score" = "Score:";
    "order_grab_laborer_grabed" = "Grabed";
    "order_grab_laborer_ungrabed" = "Not Grabed";
    "order_charge" = "Charge Details";
    "order_charge_name" = "Name:";
    "order_charge_amount" = "Amount:";
    "order_charge_name_placeholder" = "Enter Name";
    "order_charge_amount_placeholder" = "Enter Amount";
    "order_charge_notice_empty_name" = "Name cannot be empty.";
    "order_charge_notice_empty_amount" = "Cost cannot be Empty.";
    
    "order_sign" = "Signature";
    "order_sign_customer" = "Customer Signature";
    "order_sign_supervisor" = "Supervisor Signature";
    "order_sign_finished" = "Signatured";
    
    "order_code" = "Order Code";
    "order_laborer" = "Executor";
    "order_location" = "Location";
    
    "order_undo_no_data" = "No Data";
    "order_dispach_no_data" = "No Data";
    "order_approval_no_data" = "No Data";
    "order_validate_no_data" = "No Data";
    "order_close_no_data" = "No Data";
    
    "order_time_used" = "%.1f hours";
    "order_filter_time_used" = "Estimated Hours(h):";
    
    "order_detail_common_time_reserve" = "Reserve Time:";
    "order_detail_common_time_estimate" = "Estimate Time:";
    "order_detail_common_location" = "Location:";
    "order_detail_common_desc" = "Description:";
    "order_detail_common_org" = "Department:";
    "order_detail_common_serviceType" = "ServiceType:";
    "order_detail_common_pfmcode" = "PFM Code:";
    
    "order_status_create" = "Created";
    "order_status_dispached" = "Assigned";
    "order_status_process" = "In Progress";
    "order_status_stop" = "Pause";
    "order_status_teminate" = "Terminated";
    "order_status_finish" = "Completed";
    "order_status_validation" = "Verified";
    "order_status_close" = "Archived";
    "order_status_approve" = "In Approving";
    "order_status_delayed_finished" = "Delayed Completed";
    "order_status_discard" = "Discard";
    
    "order_grab_status_untook" = "Grabing";
    "order_grab_status_approve" = " In Approving";
    "order_grab_status_success" = "Grabed Success";
    "order_grab_status_fail" = "Grabed Failed";
    
    "order_step_create" = "Create";
    "order_step_dispach" = "Assign";
    "order_step_receive" = "Receive";
    "order_step_update" = "Update";
    "order_step_stop" = "Pause";
    "order_step_terminate" = "Stop";
    "order_step_finish" = "Complete";
    "order_step_validate" = "Verify";
    "order_step_close" = "Archive";
    "order_step_approval_request" = "Apply for approving";
    "order_step_approval" = "Approve";
    "order_step_escalation" = "Order Escalated";
    "order_step_continue" = "Continue";
    "order_step_reject" = "Return";
    
    "order_evaluate_timeliness" = "Timeliness";
    "order_evaluate_service" = "Service quality";
    "order_evaluate_work" = "Work quality";
    "order_evaluate_option" = "Please type in Comment:";
    "order_evaluate_score" = "Score";
    
    "order_laborer_status_un_accept" = "Unreceived";
    "order_laborer_status_accept" = "Received";
    "order_laborer_status_back" = "Returned";
    "order_laborer_status_submit" = "Submitted";
    
    "order_equipment_repqir_type_repair" = "Repair";
    "order_equipment_repqir_type_rectify" = "Rectify";
    "order_equipment_repqir_type_replace" = "Replace";
    
    "order_menu_save" = "Save";
    "order_menu_finish" = "Complete";
    "order_menu_evaluate" = "Evaluate";
    "order_menu_process" = "Handling";
    
    "order_approval_problem" = "Reason for approving";
    "order_approval_reason_placeholder" = "Enter Reason";
    "order_approval_reason_input_max" = "You can input %ld words here at max.";
    "order_approval_person" = "Approvers";
    
    "order_approval_type" = "Type";
    "order_approval_content" = "Review Points";
    "order_base_info" = "Base Info";
    "order_work_content" = "Work";
    "order_work_history" = "Record";
    "order_equipment" = "Faulty Equipment";
    "order_failure_reason" = "Faulty Reason";
    "order_tool" = "Tools";
    "order_planned_step" = "Maintenance";
    "order_step" = "History Record";
    "order_material" = "Material";
    "order_attachment" = "Attachment";
    "order_related_order" = "Related Order";
    
    "order_work_content_edit" = "Enter Work Contents";
    "order_work_content_notice" = "Please enter content";
    
    "order_tool_name" = "Name";
    "order_tool_amount" = "Quantity";
    "order_tool_unit" = "Unit";
    "order_tool_cost" = "Cost(U/P)";
    "order_tool_desc" = "Remarks";
    "order_tool_brand" = "Brand";
    "order_tool_model" = "Model";
    "order_tool_name_placeholder" = "Enter Name";
    "order_tool_amount_placeholder" = "Enter Amount";
    "order_tool_unit_placeholder" = "Enter Unit";
    "order_tool_cost_placeholder" = "Enter Cost(￥)";
    "order_tool_desc_placeholder" = "Enter Description";
    "order_tool_brand_placeholder" = "Enter Brand";
    "order_tool_model_placeholder" = "Enter Model";
    "order_tool_no_data" = "No Data";
    
    "order_tool_notice_name_empty" = "No material name.";
    "order_tool_notice_amount_empty" = "Amount is 0.";
    "order_tool_notice_unit_empty" = "Unit is empty.";
    "order_tool_notice_cost_empty" = "Cost is 0.";
    
    
    "order_tool_add" = "Add Tool";
    "order_tool_edit" = "Update Tool";
    
    "order_charge_add" = "Add Charge";
    "order_charge_edit" = "Updata Charge";
    
    "order_select_failure_reason" = "Select Failure Reason";

    
    "order_equipment_add" = "Add Fault Equipment";
    "order_equipment_edit" = "Update Fault Equipment";
    
    "order_equipment_name" = "Name:";
    "order_equipment_name_placeholder" = "Click to select equipment";
    "order_equipment_status" = "Status:";
    "order_equipment_status_placeholder" = "Click to select status";
    "order_equipment_repair_type" = "Repair Type:";
    "order_equipment_repair_type_placeholder" = "Click to select repair type";
    "order_equipment_system" = "Category:";
    "order_equipment_code" = "Code:";
    "order_equipment_code_placeholder" = "Click to select equipment";
    "order_equipment_desc" = "Description:";
    "order_equipment_desc_placeholder" = "Enter Fault Description";
    "order_equipment_repair" = "Maintenance Method:";
    "order_equipment_repair_placeholder" = "Enter Repair Description";
    "order_equipment_location" = "Location:";
    "order_equipment_no_data" = "No Data";
    "order_equipment_notice_empty" = "Please select one more equipment.";
    "order_equipment_status_finished" = "Finished";
    "order_equipment_status_unfinished" = "Unfinished";
    "order_equipment_qrcode_error" = "Failed to pair qrcode.";
    
    "order_equipment_edit_success" = "Upload successfully.";
    "order_equipment_edit_fail" = "Upload failed.";
    "order_equipment_delete_success" = "Operate successfully.";
    "order_equipment_delete_fail" = "Operate failed.";
    
    "order_equipment_repairtype_exchange" = "Exchange";
    "order_equipment_repairtype_repair" = "Repair";
    "order_equipment_repairtype_rectify" = "Rectify";
    
    
    
    "order_notice_equipment_exception_status_stop" = "The current equipment is stopped.";
    "order_notice_equipment_process_format" = "Whether submit or not? You still have %d equipments uncompleted.";
    
    "order_record_code" = "Number:";
    "order_record_time" = "Time:";
    "order_record_person" = "Handler:";
    "order_record_step" = "Step:";
    "order_record_content" = "Content:";
    
    
    
    
    "order_btn_add" = "Add";
    "order_btn_edit" = "Update";
    "order_btn_reserve" = "Reserve";
    
    "order_warehouse_name" = "Warehouse:";
    "order_warehouse_name_placeholder" = "Click to select a warehouse.";
    "order_material_add" = "Add Material";
    "order_material_edit" = "Modify Material";
    "order_material_list" = "Material List:";
    
    "order_notice_reserve_amount" = "Please select materials.";
    "order_notice_reserve" = "Please select one more material.";
    "order_notice_warehouse" = "Please select one warehouse.";
    "order_notice_no_bat" = "There no available batch.";
    "order_notice_more_than_inventory" = "Book number should less than store number,pls confirm.";
    "order_notice_more_than_batch" = "Book number should less than batch number,pls confirm.";
    "order_notice_material_exist" = "The material is exist.";
    "order_notice_material_amount_error" = "Please fill in the reservation number.";
    "order_notice_someone_unreceive" = "Exist unreceived operator,so cannot complete work order";
    "order_notice_reservation_handler_empty" = "Info of some reservation is not complete.";
    "order_alert_delete_material" = "Sure to delete this material?";
    
    "order_notice_delete_approver" = "Sure to delete this approver?";
    "order_notice_delete_worker" = "Sure to delete this executor?";
    "order_notice_delete_equipment" = "Sure to delete this equipment?";
    
    "order_material_reserve_success" = "Material booking successfully.";
    "order_material_update_success" = "Material update successfully.";
    "order_material_reserve_fail" = "Material booking failed.";
    "order_material_operation_fail" = "Operation failed.";
    "order_notice_equipment_exist" = "The equipment is exist.";
    
    "order_material_name" = "Name:";
    "order_material_brand" = "Brand:";
    "order_material_model" = "Model:";
    "order_material_unit" = "Unit:";
    "order_material_amount" = "Quantity:";
    "order_material_inventory_amount" = "Inventory Quantity:";
    "order_material_over_due" = "Due Time:";
    "order_material_reserve_amount" = "Reserved Quantity:";
    
    "order_material_name_placeholder" = "Click to select a material";
    "order_material_brand_placeholder" = "Brand";
    "order_material_model_placeholder" = "Model";
    "order_material_inventory_quantity_placeholder" = "Inventory Quantity";
    "order_material_reserve_quantity_placeholder" = "Reservation quantity";
    
    "order_material_no_data" = "No Data";
    
    "order_step_number" = "No.";
    "order_step_step" = "Step:";
    "order_step_workTeam" = "Team:";
    "order_step_work_desc" = "Description";
    "order_step_is_finish" = "Completed:";
    "order_step_finish_yes" = "Completed";
    "order_step_finish_no" = "Uncompleted";
    
    
    "order_notice_call_fail_telno" = "Phone number format is wrong, call failed.";
    
    "order_time_setting" = "%@ Work Time";
    "order_time_picker" = "Date Picker";
    "order_time_arrive_reality" = "Arrival Date";
    "order_time_finish_reality" = "Complete Date";
    
    "order_content_edit" = "Enter Work Contents";
    "order_switch_finish" = "Completed:";
    "order_step_edit" = "Maintenance Step Edit";
    "order_history_no_data" = "No Data";
    
    "order_priority" = "Priority";
    "order_filter_status" = "Work Order Status";
    "order_filter_location_label" = "Location";
    "order_filter_location" = "Select location:";
    "order_detail" = "Work Order Details";
    
    "order_detail_create_desc" = "Created by %@ at %@";
    
    "order_detail_expand" = "Expand";
    "order_detail_unexpand" = "Hide";
    
    "order_operation_terminate" = "Stop";
    "order_operation_dispach" = "Assign";
    "order_operation_approval" = "Approve";
    "order_operation_approval_request" = "Apply for approving";
    "order_operation_save" = "Save";
    "order_operation_back" = "Return";
    "order_operation_pause" = "Pause";
    "order_operation_finish" = "Complete";
    "order_operation_receive" = "Receive";
    "order_operation_continue" = "Continue";
    "order_operation_un_continue" = "Not Continue";
    "order_operation_refuse" = "Refuse";
    "order_operation_pass" = "Pass";
    "order_operation_assign" = "Assign";
    "order_operation_handle" = "Perform";
    "order_operation_grab" = "Grab";
    "order_operation_validate" = "Verify";
    "order_operation_validate_pass" = "Pass";
    "order_operation_validate_refuse" = "Refuse";
    "order_operation_close" = "Archive";
    "order_back_reason" = "Enter Reason";
    "order_terminate_reason" = "Enter Reason";
    "order_approval_reason" = "Enter Reason";
    "order_pause_reason" = "Enter Reason";
    "order_workorder" = "Work order";
    "order_approval_desc" = "Enter Reason";
    "order_validate_desc" = "Enter Reason";
    
    
    "order_alert_title_back" = "Reject Work Order";
    "order_alert_title_pause" = "Pause  Work Order";
    "order_alert_title_terminate" = "Terminate Work Order";
    "order_alert_title_finish" = "Complete Work Order";
    "order_alert_title_approval" = "Work Order Approve";
    "order_alert_title_validate" = "Verify Work Order";
    
    "order_laborer_name" = "Executor:";
    "order_laborer_position" = "Position:";
    "order_laborer_contact" = "Contact:";
    "order_laborer_time" = "Work Time:";
    "order_laborer_responsible" = "Responsible";
    "order_laborer_time_arrive" = "Arrive Time:";
    "order_laborer_time_finish" = "Completed Time:";
    "order_laborer_responsible" = "Charge";
    "order_work_content_placeholder" = "Please enter content";
    
    
    
    "order_laborer_add" = "Executor";
    "order_laborer_estimate" = "Estimated Time of Work";
    "order_laborer_estimate_time_start" = "Estimated Start Time";
    "order_laborer_estimate_time_end" = "Estimated End Time";
    "order_laborer_responsible_desc" = "Select one responsible person";
    "order_approver_add" = "Select Approver(Multi-add)";
    "order_approver_add_desc" = "Please enter approved content";
    "order_approver" = "Approver";
    
    "order_cost_material" = "Cost Of Material";
    "order_cost_tool" = "Cost Of Tool";
    "order_charge_edit_notice_material" = "Only in the tool details can you edit the charge of tools.";
    
    //计划性维护
    "maintenance_message_title" = "PPM";
    "maintenance_task_desc" = " task";
    "maintenance_task_desc_multi" = " tasks";
    "maintenance_task_month" = "Task in %ld-%ld";
    "maintenance_finished" = "Completed";
    "maintenance_leak" = "Missed";
    "maintenance_not_begin" = "Uncompleted";
    "maintenance_process" = "Doing";
    "maintenance_notice_no_order" = "No maintenance work orders.";
    "maintenance_work_group" = "Team:";
    "maintenance_cycle" = "Frequency:";
    "maintenance_first_time" = "First Maintenance Date:";
    "maintenance_next_time" = "Next Maintenance Date:";
    "maintenance_used_time" = "Estimated Time:";
    "maintenance_auto_order" = "Auto Create:";
    "maintenance_auto_order_yes" = "Yes";
    "maintenance_auto_order_no" = "No";
    "maintenance_day_shift" = "Ahead:";
    "maintenance_equipment" = "Equipment";
    "maintenance_location" = "Location";
    "maintenance_name" = "Name:";
    "maintenance_important" = "Important";
    "maintenance_effect" = "Effect:";
    "maintenance_base_info" = "Base Info";
    "maintenance_step" = "Step";
    "maintenance_attachment" = "Attachment";
    "maintenance_material" = "Material";
    "maintenance_tool" = "Tool";
    "maintenance_content" = "Content";
    "maintenance_content_colon" = "Content:";
    "maintenance_target" = "Target";
    "maintenance_order" = "Work Order";
    "maintenance_day" = "Day";
    "maintenance_day_multi" = "Days";
    "maintenance_detail" = "Maintenance Detail";
    "maintenance_notice_request_calendar_fail" = "Request maintenance calendar failed";
    
    //设备台账
    "asset_status_idle" = "IDLE";
    "asset_status_stop" = "STOP";
    "asset_status_using" = "IN USE";
    "asset_status_repairing" = "REPAIRING";
    "asset_status_discard" = "DISCARD";
    "asset_status_lock" = "LOCK";
    "asset_status_scraping" = "DISCARDING";
    
    "asset_code" = "Code:";
    "asset_base_info" = "Base info";
    "asset_parameter_info" = "Parameter info";
    "asset_base_info_placeholder" = "Name/Brand/Model";
    "asset_location" = "Location:";
    "asset_system" = "Category:";
    "asset_qrcode_error" = "QR code cannot be recognized,please confirm.";
    "asset_qrcode_exist" = "Equipment already exist";
    "asset_repair" = "Repaired";
    "asset_maintenance" = "Maintenance";
    "asset_no_data" = "No Equipment";
    "asset_qrcode_pair_fail" = "QR code cannot be recognized,please confirm.";
    "asset_detail" = "Asset Details";
    "asset_detail_no_data" = "No Detail Info.";
    "asset_photo" = "Photo";
    
    "asset_life_span_unit" = "year";
    "asset_life_span_unit_multi" = "years";
    
    
    "asset_equipment_info" = "Facility";
    "asset_factory_info" = "Factory";
    "asset_contract_info" = "Contract";
    "asset_repair_record" = "Repair";
    "asset_maintenance_record" = "Maintenance";
    
    "asset_maintenance_no_data" = "No Maintenance Record";
    "asset_repair_no_data" = "No Repair Record";
    "asset_contract_no_data" = "No Contract";
    "asset_factory_no_data" = "No Factory";
    
    "asset_contract_repair" = "Repairment Contracts";
    "asset_contract_maintenance" = "Maintenance Contracts";
    "asset_contract_other" = "Other Contract";
    
    "asset_service_area" = "Area";
    "asset_service_target" = "Target";
    
    "asset_factory_product" = "Productor";
    "asset_factory_supply" = "supplier";
    "asset_factory_install" = "Installation Unit";
    
    "asset_contract_code" = "Contract No.";
    "asset_contract_unit" = "Department";
    "asset_contract_time_start" = "Start Date";
    "asset_contract_time_end" = "Due Date";
    "asset_contract_cost" = "Amount";
    "asset_contract_desc" = "Contract Intro";
    
    "asset_contract_repair" = "Repair Contract";
    "asset_contract_maintenance" = "Maintenance Contract";
    "asset_contract_other" = "Other Contract";
    
    "asset_factory_contact" = "Contact";
    "asset_factory_telno" = "Phone";
    "asset_factory_address" = "Address";
    
    "asset_factory_manufacturer" = "Manufacturer";
    "asset_factory_supplier" = "Provider";
    "asset_factory_installation" = "Installation Unit";
    
    "asset_equipment_name" = "Name";
    "asset_equipment_code" = "Code";
    "asset_equipment_location" = "Location";
    "asset_equipment_system" = "Category";
    "asset_equipment_status" = "Status";
    "asset_equipment_repairtype" = "Repair Type";
    "asset_equipment_brand" = "Brand";
    "asset_equipment_model" = "Model";
    "asset_equipment_serial_number" = "SN";
    "asset_equipment_manufacture_date" = "Factory Date";
    "asset_equipment_installation_date" = "Install Date";
    "asset_equipment_commissiong_date" = "Used Date";
    "asset_equipment_weight" = "Weight";
    "asset_equipment_age" = "Life";
    "asset_equipment_desc" = "Description";
    
    
    "asset_parammeter_unit" = "Unit";
    "asset_parameter_default" = "Value";
    "asset_parammeter_desc" = "Description";
    "asset_no_data" = "No Data";
    
    //报障
    "report_service_type" = "ServiceType";
    "report_content" = "Work Content";
    "report_location" = "Location";
    "report_reporter" = "Applicant";
    "report_org" = "Department";
    "report_telno" = "Contact";
    "report_order_type" = "Order Type";
    "report_priority" = "Priority";
    
    "report_order_type_maintenance" = "Corrective Maintenance";
    "report_order_type_self_check" = "self-inspection";
    "report_order_type_mix" = "Mixed";
    
    "report_add_equipment" = "Add Fault Equipment";
    "report_question_desc" = "Enter Description";
    "report_request_reporter" = "Could not get requestor info.";
    "report_request_service_type" = "Please select a service type first.";
    "report_request_priority" = "Please select a priority first.";
    "report_request_phone" = "Please enter tel.";
    "report_upload_success" = "Data upload successfully";
    "report_upload_fail" = "Report data upload failed.";
    "report_upload_fail_saved" = "Data upload failed. It has been saved.";
    "report_upload_fail_un_saved" = "Data upload failed. Saved failed.";
    "report_upload_fail_check_internet" = "Request failed. Please check the data and the network settings.";
    "report_equipment_exist" = "The Equipment has been exist.";
    "report_upload_no_data" = "No Record";
    "report_noitce_delete_this" = "Sure to delete the record?";
    
    "report_my_no_data" = "No Data";
    "report_my_order_desc" = "Description";
    
    "report_baseInfo_header_title" = "Basic Info";
    "report_device_header_title" = "Malfunction Equipment";
    "report_description_header_title" = "Description";
    
    //服务台
    "requirement_status_create" = "Created";
    "requirement_status_process" = "Progressing";
    "requirement_status_finish" = "Completed";
    "requirement_status_evaluate" = "Evaluated";
    
    "requirement_origin_web" = "web";
    "requirement_origin_phone" = "phone";
    "requirement_origin_wechat" = "wechat";
    "requirement_origin_email" = "email";
    
    "requirement_code" = "Code:";
    "requirement_origin" = "Source:";
    "requirement_requestor" = "Requestor:";
    "requirement_phone" = "Phone:";
    "requirement_desc" = "Description:";
    "requirement_type" = "Type:";
    
    "requirement_requestor_name" = "Name:";
    "requirement_requestor_appellation" = "Applicantion:";
    "requirement_requestor_position" = "Posiiton:";
    "requirement_requestor_org" = "Department:";
    "requirement_requestor_phone" = "Phone:";
    "requirement_requestor_mobile" = "Mobile:";
    
    "requirement_requestor_format" = "Created by %@ at %@";
    
    "requirement_satisfaction_title" = "Satisfaction evaluation";
    "requirement_satisfaction" = "Satisfaction";
    "requirement_evaluate_comment" = "Evaluate Comment:";
    
    "requirement_record_date_format" = "M月dd日";
    
    "requirement_create_order" = "Create order";
    "requirement_pass" = "Pass";
    
    "requirement_photo" = "Photo";
    "requirement_audio" = "Audio";
    "requirement_video" = "Video";
    
    "requirement_info" = "Base Info";
    "requirement_content" = "Content";
    "requirement_order" = "Related Order";
    "requirement_record" = "Record";
    "requirement_attachment" = "Attachment";
    
    
    "requirement_content_placeholder" = "Please enter content:";
    
    "requirement_my_no_data" = "No Data";
    "requirement_evaluate_no_data" = "No Data";
    "requirement_undo_no_data" = "No Data";
    "requirement_approval_no_data" = "No Data";
    
    "requirement_satisfaction_no_data" = "No satisfaction data";
    
    
    "requirement_notice_reqtype" = "Please select a requirement type";
    "requirement_notice_description" = "Please enter description";
    
    "requirement_upload_fail" = "Data upload failed. Please check your internet";
    "requirement_upload_success" = "Data upload success";
    "requirement_order_unfinished" = "Some orders have not been completed.";
    
    
    "requirement_headlbl_picture" = "Pictures";
    "requirement_headlbl_audio" = "Audio";
    "requirement_headlbl_video" = "Video";
    
    
    "requirement_req_person" = "Applicant";
    "requirement_req_person_placeholder" = "Enter Applicant";
    "requirement_req_phone" = "Phone";
    "requirement_req_phone_placeholder" = "Enter Phone";
    "requirement_req_type" = "Type";
    "requirement_req_type_placeholder" = "Enter Type";
    "requirement_req_desc" = "Description";
    "requirement_req_desc_placeholder" = "Enter Description";
    
    "requirement_req_loaction" = "Location";
    
    "requirement_notice_person_empty" = "Applicant can't be empty.";
    "requirement_notice_type_empty" = "Requirement type can't be empty.";
    "requirement_notice_desc_empty" = "Description of requirement can not be empty.";
    "requirement_notice_vide_making_zip" = "The file is under compression, wait a moment please.";
    
    "requirement_voice_record_start" = "Start";
    
    "requirement_add_media_photo" = "Photo";
    "requirement_add_media_camera" = "Camera";
    "requirement_add_media_voice" = "Voice";
    "requirement_add_media_video" = "Video";
    
    "requirement_record_title_str_create" = "New requirement";
    "requirement_record_title_str_approval" = "Apporve";
    "requirement_record_title_str_order" = "Create work order";
    "requirement_record_title_str_process" = "Follow up";
    "requirement_record_title_str_followup" = "Visit back";
    "requirement_record_title_str_finsih" = "Finish";
    
    "requirement_evaluate_desc" = "Description";
    "requirement_evaluate_desc_placeholder" = "Enter Description";
    "requirement_evaluate_quality" = "Service Quality";
    "requirement_evaluate_speed" = "Service Speed";
    "requirement_evaluate_attitude" = "Service Attitude";
    
    "requirement_evaluate_failed" = "Evaluate Failed";
    "requirement_evaluate_success" = "Evaluate Success";
    
    //库存
    "inventory_reserve_code" = "Reservation Code";
    "inventory_reserve_administrator" = "Warehouse Administrator";
    "inventory_reserve_supervisor" = "Approval Supervisor";
    "inventory_reserve_person" = "Applicant";
    "inventory_reserve_administrator_placeholder" = "Click to select an administrator.";
    "inventory_reserve_supervisor_placeholder" = "Click to select a supervisor.";
    "inventory_reserve_person_placeholder" = "";
    "inventory_reserve_time" = "Date";
    "inventory_reserve_desc" = "Description";
    "inventory_reserve_material" = "Materials";
    "inventory_btn_delivery" = "Delivery";
    "inventory_btn_stock_out" = "Delivery";
    "inventory_btn_cancel" = "Refuse";
    "inventory_btn_cancel_reservation" = "Cancellation";
    "inventory_btn_reserve" = "Reserve";
    "inventory_btn_transfer" = "Move";
    "inventory_btn_add" = "Add";
    "inventory_btn_edit" = "Edit";
    
    "inventory_reserve_code_colon" = "Reservation Code:";
    "inventory_reserve_person_colon" = "Applicant:";
    "inventory_reserve_time_colon" = "Date:";
    "inventory_reserve_warehouse_colon" = "Warehouse:";
    "inventory_reserve_order_colon" = "Related Order:";
    "inventory_reserve_desc_colon" = "Description:";
    "inventory_reserve_material_colon" = "Materials:";
    
    "inventory_reserve_approval_type_undo" = "Unapprovaled";
    "inventory_reserve_approval_type_finish" = "Approvaled";
    
    "inventory_reserve_detail_operation_approval" = "Approval";
    "inventory_reserve_detail_operation_delivery" = "Delivery";
    
    "inventory_reserve_detail_operation_approval" = "Pass";
    "inventory_reserve_detail_operation_delivery" = "Refuse";
    
    "inventory_receive_person" = "Receiving Person";
    "inventory_receive_person_colon" = "Receiving Person:";
    "inventory_receive_time" = "Receiving Date:";
    
    "inventory_approval_status_approvaling" = "In Approving";
    "inventory_approval_status_success" = "Passed";
    "inventory_approval_status_fail" = "Refused";
    "inventory_approval_status_finished" = "Finished";
    "inventory_reservation_status_cancel" = "Cancel Delivery";
    "inventory_reservation_status_cancel_reservation" = "Cancel Reservation";
    
    "inventory_no_data_history" = "No More Record";
    "inventory_no_data_approval" = "No More Record";
    "inventory_no_data_reserved" = "No More Record";
    "inventory_no_data_reserve" = "No More Record";
    
    "inventory_cancel_success" = "Cancel successfully.";
    "inventory_cancel_fail" = "Cancel failed.";
    "inventory_cancel_reservation_success" = "Cancel successfully.";
    "inventory_cancel_reservation_fail" = "Cancel failed.";
    "inventory_reserve_success" = "Reserve successfully.";
    "inventory_reserve_fail" = "Reserve failed.";
    "inventory_delivery_success" = "Delivery successfully.";
    "inventory_delivery_fail" = "Delivery failed.";
    "inventory_transfer_success" = "Operate successfully.";
    "inventory_transfer_fail" = "Operate failed.";
    "inventory_edit_handler_success" = "Operate successfully.";
    "inventory_edit_handler_fail" = "Operate failed.";
    
    "inventory_in_stock" = "In Stock";
    "inventory_no_stock" = "No Stock";
    
    
    "inventory_notice_warehouse" = "Please select a warehouse.";
    "inventory_notice_warehouse_src" = "Please select a source warehouse.";
    "inventory_notice_warehouse_target" = "Please select a target warehouse.";
    "inventory_notice_administrator" = "Please select an administrator of the warehouse.";
    "inventory_notice_administrator_src" = "Please select a source administrator.";
    "inventory_notice_administrator_target" = "Please select a target administrator.";
    "inventory_notice_supervisor" = "Please select a supervisor.";
    "inventory_notice_reserving_person" = "Please select a person for reserving.";
    "inventory_notice_receiving_person" = "Please select a person for receiving.";
    "inventory_notice_no_person" = "No person to select.";
    "inventory_notice_no_supervisor" = "No supervisor to select.";
    "inventory_notice_warehouse_src_target_same" = "The source warehouse is same as target warehouse";
    "inventory_notice_material_delete" = "Sure to delete this material?";
    "inventory_notice_material_delete_success" = "Operate successfully.";
    "inventory_notice_material_delete_fail" = "Operate failed.";
    "inventory_notice_material" = "Please select materials.";
    "inventory_notice_material_out_empty" = "Amount can't be zero.";
    "inventory_notice_material_batch_empty" = "Please add one more batch.";
    "inventory_notice_warehouse_using" = "The warehouse is in use.";
    "inventory_notice_material_name_error" = "Please select a material.";
    "inventory_notice_material_amount_error" = "Please enter the reservation number";
    "inventory_notice_delivery_amount_less_than_reserved" = "The number of deliverying can not be greater than reserving.";
    "inventory_notice_delivery_amount_less_than_batch" = "The number of deliverying can not be greater than stock.";
    "inventory_notice_delivery_amount_less_than_realnumber" = "The number of deliverying can not be greater than real number.";
    "inventory_notice_delivery_amount_less_than_totalnumber" = "The number of deliverying can not be greater than total number.";
    
    "inventory_notice_material_no_right" = "Sorry,you don't have power to Operate this material";
    
    "inventory_notice_more_than_inventory" = "Book number should less than store number,pls confirm.";
    "inventory_notice_batch_empty" = "The material without batches shouldn't do stocktaking.";
    "inventory_notice_material_exist" = "The material is exist.";
    "inventory_notice_warehouse_amount" = "(Notice:Add materials from the same warehouse)";
    "inventory_notice_delivery_receive_amount" = "Please select one more materials and enter the amount for receiving.";
    "inventory_notice_shift_receive_amount" = "Please select one more materials and enter the amount for shifting.";
    "inventory_notice_cancel_delivery_reason" = "Please enter reason for your operation.";
    "inventory_notice_cancel_reservation_reason" = "Please enter reason for your operation.";
    
    "inventory_notice_delivery_success" = "Operate successfully.";
    "inventory_notice_delivery_fail" = "Operate failed.";
    "inventory_notice_cancel_delivery_success" = "Operate successfully.";
    "inventory_notice_cancel_delivery_fail" = "Operate failed.";
    
    "inventory_notice_approval_pass_success" = "Pass";
    "inventory_notice_approval_pass_fail" = "Failed";
    "inventory_notice_approval_refuse_success" = "Refused";
    "inventory_notice_approval_refuse_fail" = "Failed";
    "inventory_notice_approval_empty" = "Empty Reason";
    
    "inventory_detail_base" = "Base Info";
    "inventory_detail_material" = "Materials";
    "inventory_detail_order" = "Orders";
    
    "inventory_detail_base_code_colon" = "Code:";
    "inventory_detail_base_warehouse_colon" = "Warehouse:";
    "inventory_detail_base_applicant_colon" = "Applicant:";
    "inventory_detail_base_date_colon" = "Date:";
    "inventory_detail_base_order_colon" = "Order:";
    "inventory_detail_base_desc_colon" = "Description:";
    
    "inventory_detail_material_name_colon" = "Name:";
    "inventory_detail_material_brand_colon" = "Brand:";
    "inventory_detail_material_model_colon" = "Model:";
    "inventory_detail_material_count_reserved" = "Reserved*";
    "inventory_detail_material_count_received" = "Received*";
    "inventory_detail_material_cost_colon" = "Cost(U/P):";
    
    "inventory_detail_approval_title" = "Reservation Approval";
    "inventory_detail_approval_desc_placeholder" = "Enter reason here";
    "inventory_detail_delivery_title" = "Delivery Reservation";
    "inventory_detail_delivery_cancel_title" = "Cancel Reservation";
    "inventory_detail_delivery_count_colon" = "Delivery Amount:";
    "inventory_detail_delivery_warehouse_colon" = "Warehouse:";
    "inventory_detail_delivery_applicant_colon" = "Applicant:";
    "inventory_detail_delivery_date_colon" = "Date:";
    
    "inventory_material_title_add" = "Material Add";
    "inventory_material_title_edit" = "Material Edit";
    
    "inventory_material_code" = "Code";
    "inventory_material_name" = "Name";
    "inventory_material_brand" = "Brand";
    "inventory_material_model" = "Model";
    "inventory_material_amount" = "Inventory Quantity";
    "inventory_material_reserve_amount" = "Reserve Quantity";
    "inventory_material_reserve_cost" = "Cost(U/P)";
    
    "inventory_material_placeholder_code" = "Click to select a material";
    "inventory_material_placeholder_name" = "Click to select a material";
    "inventory_material_placeholder_brand" = "Brand";
    "inventory_material_placeholder_model" = "Model";
    "inventory_material_placeholder_amount" = "Inventory amount";
    "inventory_material_placeholder_reserve_amount" = "Reserved amount";
    "inventory_material_placeholder_reserve_cost" = "Cost(U/P)";
    
    "inventory_material_desc_code" = "Code：";
    "inventory_material_desc_name" = "Name：";
    "inventory_material_desc_warehouse" = "Warehouse：";
    "inventory_material_desc_brand" = "Brand：";
    "inventory_material_desc_model" = "Model：";
    "inventory_material_desc_dbcount" = "Storage Count：";
    "inventory_material_desc_realnumber" = "Real number：";
    "inventory_material_desc_count_in" = "Deposit Count：";
    "inventory_material_desc_count_out" = "Deliveried：";
    "inventory_material_desc_count_reserve" = "Reserved：";
    "inventory_material_desc_count_move" = "Shift number：";
    
    "inventory_material_desc_unit" = "Unit：";
    "inventory_material_desc_deciding_price" = "Unit-Price(￥)：";
    "inventory_material_desc_minnumber" = "Min Number：";
    "inventory_material_desc_reservednumber" = "Reserved Number：";
    "inventory_material_desc_notice" = "Note：";
    "inventory_material_desc_photo" = "Picture：";
    "inventory_material_desc_attachment" = "Attachment：";
    "inventory_material_desc_provider" = "Provider：";
    "inventory_material_desc_ordercode" = "Code：";
    "inventory_material_desc_duetime" = "DueTime：";
    "inventory_material_desc_price" = "Unit-Price(￥)：";
    "inventory_material_desc_amount" = "Amount：";
    "inventory_material_desc_storage_amount" = "Storage Amount：";
    "inventory_material_desc_real_amount" = "Real Number：";
    "inventory_material_desc_storage_time" = "Storage Time：";
    "inventory_material_desc_count_amount" = "Check Anmount：";
    
    "inventory_provider_empty" = "No Data";
    "inventory_warehouse_empty" = "No Data";
    "inventory_no_data" = "No Data";
    "inventory_material_empty" = "No Data";
    "inventory_storage_out_empty" = "No Data";
    
    "inventory_material_section_title_detail" = "Inventory Detail";
    "inventory_material_section_title_record" = "Inventory Record";
    "inventory_material_section_title_batch" = "Inventory Batch";
    "inventory_material_section_title_batch_count" = "Batch Count";
    
    "inventory_material_check_upload_success" = "Data upload success";
    "inventory_material_check_upload_fail" = "Data upload failed";
    "inventory_material_storage_success" = "Storage success";
    
    "inventory_material_batch_title" = "Batch Add";
    "inventory_material_batch_title_edit" = "Batch Edit";
    "inventory_material_batch_provider" = "Provider";
    "inventory_material_batch_provider_placehoder" = "Select Provider";
    "inventory_material_batch_duetime" = "Due Time";
    "inventory_material_batch_duetime_placehoder" = "Select Due Time";
    "inventory_material_batch_price" = "Unit-price(￥)";
    "inventory_material_batch_price_placehoder" = "Type in unit-price";
    "inventory_material_batch_amount" = "Amount";
    "inventory_material_batch_amount_placehoder" = "Type in amount";
    
    //出库
    "inventory_out_type_reservation" = "Reserved";
    "inventory_out_type_direct" = "Direct";
    "inventory_out_header_warehouse" = "Warehouse:";
    "inventory_out_header_material" = "Material";
    
    "inventory_out_detail_header_material" = "Material Info";
    "inventory_out_detail_header_reserved_amount" = "Reserved Amount:";
    
    "inventory_out_detail_header_batch" = "Batch";
    "inventory_out_detail_header_batch_amount" = "Amount:";
    "inventory_shift_detail_header_batch" = "Batch";
    "inventory_shift_detail_header_batch_amount" = "Amount:";
    
    "inventory_out_detail_batch_provider" = "Provider:";
    "inventory_out_detail_batch_date" = "Date In:";
    "inventory_out_detail_batch_due_date" = "Date Expire:";
    "inventory_out_detail_batch_price" = "Unit Price:";
    "inventory_out_detail_batch_inventory_amount" = "Valid Quantity:";
    "inventory_out_detail_batch_amount" = "Amount:";
    
    "inventory_out_detail_batch_amount_edit_title" = "Edit Amount";
    "inventory_out_detail_batch_amount_edit_placeholder" = "Please Enter Amount";
    
    "inventory_out_administrator" = "Administrator";
    "inventory_out_administrator_placeholder" = "Click to select administrator.";
    "inventory_out_supervisor" = "Supervisor";
    "inventory_out_supervisor_placeholder" = "Click to select supervisor.";
    "inventory_out_person" = "Receiving Person";
    "inventory_out_person_placeholder" = "Click to select receiving person.";
    
    "inventory_query_condition_param_placehoder" = "Enter material name";
    
    "inventory_query_filter_empty" = "Unlimited";
    "inventory_query_filter_enough" = "Enough";
    "inventory_query_filter_lack" = "Lack";
    
    "inventory_query_filter_header_name" = "Name";
    "inventory_query_filter_header_amount" = "Inventory amount";
    
    "inventory_code_error" = "Code wrong";
    "inventory_detail_request_failed" = "Failed to request detail";
    
    "inventory_query_warehouse_name" = "Warehouse Name：";
    "inventory_query_admin" = "Administrators：";
    "inventory_query_location" = "Loaction：";
    "inventory_query_category" = "Category：";
    "inventory_query_amount" = "Amount：";
    
    
    //移库
    "inventory_transfer_warehouse_src_desc" = "Src Warehouse";
    "inventory_transfer_warehouse_src_desc_placeholder" = "Click to select a warehouse.";
    "inventory_transfer_warehouse_target_desc" = "Target Warehouse";
    "inventory_transfer_warehouse_target_desc_placeholder" = "Click to select a Warehouse.";
    
    "inventory_transfer_administrator_src" = "Administrator Of Src Warehouse";
    "inventory_transfer_administrator_src_placeholder" = "Click to select source administrator.";
    "inventory_transfer_administrator_target" = "Administrator Of Target Warehouse";
    "inventory_transfer_administrator_target_placeHolder" = "Click to select target administrator.";
    
    //能源管理
    "energy_cycle_other" = "Other";
    "energy_cycle_month" = "Once a month";
    "energy_no_data" = "No More Task";
    "energy_status_finished" = "Completed";
    "energy_status_unfinished" = "Uncompleted";
    "energy_notice_no_need_submit" = "No need to upload data.";
    "energy_task_cycle" = "Task Cycle:";
    "energy_task_lastTime" = "Last Submit:";
    "energy_task_location" = "Location:";
    "energy_task_finish_time" = "Finish time:";
    "energy_task_content_title" = "Item Content";
    
    "energy_task_notice_unfinish" = "Mission uncompleted";
    
    
    "energy_parameter_read" = "Type in data:";
    "energy_parameter_unit" = "Unit:";
    "energy_parameter_input_empty" = "Parameter empty";
    
    //修改密码
    "password_old_value" = "Old Password:";
    "password_new_value" = "New Password:";
    "password_new_value_confirm" = "New Again:";
    "password_notice_empty" = "Password can not be empty.";
    "password_notice_no_need_change" = "The new password is the same as the old one.";
    "password_notice_not_the_same" = "The passwords you typed do not match.";
    "password_reset_success" = "Congratulation, the password has been update successfully.";
    "password_reset_fail" = "Sorry to tell that the password has been update failed.";
    "password_reset_fail_note_value" = "The password you typed is not correct.";
    
    //上传
    "upload_waitting" = "Waiting";
    "upload_uploading" = "Uploading";
    "upload_success" = "Success";
    "upload_fail" = "Failed";
    "upload_notice_uploading" = "There is another task in process, wait please.";
    
    //离线下载
    "download_un_downloaded" = "Waiting";
    "download_downloading" = "Downloading";
    "download_success" = "Downloaded";
    "download_fail" = "Failed";
    "download_need_download" = "Waiting";
    "download_need_update" = "Need Update";
    "download_downloaded" = "Downloaded";
    "download_no_data" = "No Data";
    "download_notice_download" = "Request data failed, please download first.";
    "download_notice_not_need_update" = "There is no need to update.";
    "download_notice_downloading" = "Please wait for the current download task.";
    "download_device" = "Equipment info";
    "download_device_type" = "Equipment Type info";
    "download_location" = "Location Info";
    "download_org" = "Department Info";
    "download_priority" = "Priority Info";
    "download_flow" = "Work Order SLA Info";
    "download_service_type" = "Work Order Service Type Info";
    "download_requirement_type" = "Requirement Type Info";
    "download_satisfaction" = "Satisfaction Type Info";
    "download_all" = "Download All";
    "download_downloading_format" = "%.1f%@";
    
    //意见反馈
    "feedback_placeholder" = "Please describe your issue.\n(No less than 5 words)";
    "feedback_notice_input" = "Please enter your option first.";
    "feedback_notice_input_mincount" = "Please input more than %d characters.";
    "feedback_success" = "Thanks for your advice.";
    "feedback_fail" = "Fail to upload your advice.";
    
    //
    "setting_notice_cache_size" = "%@ cache detected and waiting to be cleared，clear cache now?";
    "setting_notice_cache_size_ok" = "%@ cache detected and no need to be cleared now.";
    
    //缓存
    "cache_clear" = "Clear";
    "cache_item_file" = "Temporary File";
    "cache_item_base_data" = "Base Data";
    "cache_item_patrol" = "Patrol Task";
    "cache_item_preference" = "Base Setting";
    "cache_item_message" = "Notification Messages";
    "cache_notice_select_none" = "Select one more items first.";
    "cache_notice_clear_success" = "Succeed to clear cache data.";
    "cache_notice_clear_failed" = "Failed to clear cache data.";
    "cache_notice_clear_text" = "Please make sure to clear selected items.";
    
    //关于
    "about_company_name" = "";
    
    //绑定手机号
    "bind_phone_info" = "Number:";
    "bind_btn_bind" = "Register";
    "bind_notice_telno_empty" = "The telno can not be empty.";
    "bind_notice_telno_error" = "The format of telno is not correct.";
    "bind_notice_input" = "Please enter a number.";
    "bind_notice_success" = "Congratulations, operation success.";
    "bind_phone_old_telno" = "The original number ";
    "bind_phone_input_telno" = "Telno Here";
    "bind_phone_request_code" = "Get Code";
    "bind_phone_input_new_telno" = "New Number";
    "bind_phone_input_code" = "Verification Code";
    "bind_notice_verify" = "Request verification code first please.";
    "bind_notice_verify_fail" = "Telno verifying failed.";
    
    "user_photo_set_notice_null" = "Select a photo first please.";
    
    //图表
    "chart_no_data" = "No Data";
    "chart_order_today" = "Work Order Today";
    "chart_order" = "Survey Today";
    "chart_complain_unfinished" = "Uncompleted Complaint";
    "chart_complain_total" = "Complaint Sum";
    "chart_patrol_today" = "Patrol";
    "chart_order_unfinished" = "Uncompleted WorkOrder";
    "chart_order_total" = "All WorkOrder";
    "chart_reported" = "Repaired";
    "chart_exception_patrol" = "Abnormal";
    "chart_type_other" = "Other";
    "chart_type_report" = "Report";
    
    "chart_title_today_order" = "Today's Order";
    "chart_desc_finish_all" = "Completed/Total";
    
    "chart_type_process" = "Process";
    "chart_type_dispatch" = "Assigned";
    "chart_type_validate" = "Approve";
    
    "chart_type_complain" = "Complaint";
    "chart_type_order" = "Order";
    "chart_type_inspection" = "Inspection";
    
    "chart_order_today_title" = "Today WorkOrder Analysis";
    "chart_order_currently_title" = "Weekly WorkOrder Status";
    "chart_order_finished_amount" = "Complete";
    "chart_order_total_amount" = "Total";
    
    "chart_order_total_count" = "Total Amount (Completed/Total)";
    
    "chart_order_monthly" = "Monthly OverView";
    
    "chart_requirement" = "Requirement Analysis";
    
    "chart_emergency" = "Emergency";
    "chart_due_remind" = "Expire";
    "chart_msg_no_data" = "No Message";
    
    
    //消息
    "chart_message_work_order" = "W";
    "chart_message_inspection" = "I";
    "chart_message_asset" = "A";
    "chart_message_maintenance" = "M";
    
    "chart_message_content_pai" = "[Work]An order to dispatch";
    "chart_message_content_gong" = "[Work]An order to deal with";
    "chart_message_content_ting" = "[Work]An order being paused";
    "chart_message_content_sheng" = "[Work]An order to approve";
    "chart_message_content_wan" = "[Work]An order has been completed";
    "chart_message_content_yan" = "[Work]An order has been authenticated";
    "chart_message_content_zhong" = "[Work]An order has been stopped";
    "chart_message_content_cun" = "[Work]An order has been saved";
    
    
    //
    "service_type" = "Service Type";
    
    //上传下载
    "data_submit_finished" = "Data uploads completed.";
    "data_submit_success" = "Data uploads successfully.";
    "data_submit_fail" = "Data uploads failed.";
    "image_submit_success" = "Image uploads successfully.";
    "image_submit_fail" = "Image uploads failed.";
    "file_submit_success" = "File uploads successfully.";
    "file_submit_fail" = "File uploads failed.";
    
    //提示
    "notice_photo_delete" = "Sure to delete the photo?";
    "notice_audio_delete" = "Sure to delete the audio?";
    "notice_video_delete" = "Sure to delete the video?";
    "notice_equipment_delete" = "Sure to delete the equipment?";
    "notice_tool_delete" = "Sure to delete the tool?";
    "notice_function_developing" = "We are working hard for this function, please wait.";
    "notice_delete_done" = "Done";
    "notice_delete_cancel" = "Cancel";
    "notice_device_not_support" = "Device does not support";
    
    //签名
    "signature_notice_desc" = "signature";
    "signature_button_cancel" = "cancel";
    "signature_button_done" = "signature pass";
    
    //通知
    "notification_notify_process" = "Has received a new message, would you want to process now?";
    "notification_notice_setting" = "Enable or disable %@ notification via \"Settings\" -> \"Notifications\" -> \"%@\" on your iPhone.";
    "notification_status_on" = "Enabled";
    "notification_status_off" = "Disabled";
    "notification_notify_other_project" = "Has received a new message of other project.";
    "notification_download_new" = "New Offline Download";
    
    
    //net
    "net_error_request_fail" = "Data request failed, Try again.";
    "net_need_relogin" = "Login failed as timeout, try again please.";
    "net_login_fail" = "I am sorry, I failed.";
    "net_setting" = "Net setting";
    "net_notice_connect_fail" = "Net connect failed, would you want to set now?";
    "net_btn_set_now" = "Set Now";
    "net_reachable_fail" = "Network connection failed.";
    
    //二维码
    "qrcode_notice" = "Align Qrcode within the frame to scan";
    "qrcode_notice_wait" = "Loading...";
    "qrcode_notice_permission" = "Camera opened failed. Check the setting first please.";
    "qrcode_notice_not_valid" = "Qrcode is not valid.";
    
    //UITableViewCell
    "cell_show_more_detail" = "Show More Details";
    "cell_show_all_detail" = "Show More Details";
    
    //引导页
    "introduce_txt_first" = "guide_01_txt_en";
    "introduce_txt_second" = "guide_02_txt_en";
    "introduce_txt_third" = "guide_03_txt_en";
    "introduce_txt_fourth" = "guide_04_txt_en";
    
    "introduce_img_first" = "guide_01_bg_en";
    "introduce_img_second" = "guide_02_bg_en";
    "introduce_img_third" = "guide_03_bg_en";
    "introduce_img_fourth" = "guide_04_bg_en";
    
    //工单查询筛选
    "filter_header_title_priority" = "Priority:";
    "filter_header_title_status" = "Status:";
    "filter_no_limits" = "Unlimited";
    
    
    //提示Tips
    "tips_title" = "Tips";
    
    "tips_select_actualarrival_time" = "Please confirm the actual arrvial time";
    "tips_setted_ok" = "Operate successfully.";
    "tips_setted_failed" = "Operate failed.";
    
    "tips_description_empty" = "Description can't be empty";
    
    "tips_confirm_finished" = "Please confirm finished";
    "tips_operate_success" = "Operate successfully.";
    
    "tips_operate_failed" = "Operate failed.";
    
    "tips_tools_add_success" = "Operate successfully.";
    "tips_tools_modify_success" = "Operate successfully.";
    "tips_tools_failed" = "Operate failed.";
    "tips_tools_delete_success" = "Operate successfully.";
    "tips_tools_delete_fail" = "Operate failed.";
    
    "tips_charge_add_success" = "Operate successfully.";
    "tips_charge_modify_success" = "Operate successfully.";
    "tips_charge_delete_success" = "Operate successfully.";
    
    "tips_charge_failed" = "Operate failed.";
    "tips_charge_notice_input" = "Please check your input.";
    
    "tableviewcell_delete" = "Delete";
    "tableviewcell_mark_readed" = "Read";
    "tableviewcell_mark_more" = "More";
    
    "message_controller_menu_allread" = "All read";
    "message_controller_menu_alldelete" = "All delete";
    
    //信息选择
    "filter_placeholder_common" = "Condition Here";
    
    //输入限制
    "base_text_view_limited" = "No more than %ld words";
    "base_text_view_full" = "%ld words limited";
    
    //收费项明细修改
    "work_order_charge_modify" = "Modify";
    
    
    //ppm详情
    "ppm_status_current_month" = "Current Month Tasks";
    "ppm_status_current_day" = "Selected Tasks";
    "ppm_status_finished" = "Completed";
    "ppm_status_missed" = "Missed";
    "ppm_status_undo" = "Undo";
    "ppm_status_process" = "Processing";
    
    "ppm_planned_maintain_time" = "Maintenance Date:";
    "ppm_work_order" = "Order";
    
    
    
    //资产管理模块
    "asset_detail_no_data" = "Something was wrong, Please check your Qrcode";
    
    "asset_manage_profile" = "Equipment Amount %ld, Equipment Category %ld, Maintenance Plan %ld.";
    
    "asset_header_title_profile" = "Asset profile";
    "asset_header_title_equipment" = "Equipment list";
    
    "asset_equipment_query" = "Equipment Query";
    "asset_equipment_detail" = "Equipment Info";
    
    "contract_target" = "Contract";
    "equipment_target" = "Equipment";
    "factory_target" = "Factory";
    "fixed_target" = "Repair";
    "maintain_target" = "Maintenance";
    
    "navi_title_contract_target" = "Contract Info";
    "navi_title_equipment_target" = "Equipment Info";
    "navi_title_factory_target" = "Factory Info";
    "navi_title_fixed_target" = "Fixed Record";
    "navi_title_maintain_target" = "Maintenance Record";
    
    
    
    "System_classification" = "System Classification:";
    "Installation_location" = "Installation Location:";
    
    "equipment_number" = "Equipment Code:";
    "equipment_name" = "Equipment Name:";
    "equipment_classification" = "Equipment Classify:";
    "equipment_status" = "Equipment Status:";
    "equipment_location" = "Location:";
    "equipment_brand" = "Brand:";
    "equipment_model" = "Model:";
    "equipment_count" = "Count:";
    "equipment_unit" = "Unit:";
    "equipment_brand_location" = "Nameplate position:";
    "equipment_product_location" = "Place of Origin:";
    "equipment_serialnumber" = "Serial Number:";
    "equipment_exfactorydate" = "Exfactory date:";
    "equipment_installdate" = "Install date:";
    "equipment_introductiondate" = "In-Service date:";
    "equipment_transfer_date" = "Handover date:";
    "equipment_death_date" = "Scrap date:";
    "equipment_design_life" = "Design period:";
    "equipment_expectLife_date" = "Expected life:";
    "equipment_weight" = "Weight:";
    "equipment_lifespan" = "Service Life:";
    "equipment_list" = "List:";
    "equipment_description" = "Description:";
    
    
    "equipment_header_title_baseinfo" = "BaseInfo";
    "equipment_header_title_picture" = "Pictures";
    "equipment_header_title_paremeter" = "Paremeter info";
    "equipment_header_title_area" = "Service area";
    "equipment_header_title_contract_fixed" = "Fix contract";
    "equipment_header_title_contract_maintain" = "Maintenance contract";
    "equipment_header_title_contract_other" = "Other contract";
    
    "equipment_header_title_manufactory" = "Manufacturer:";
    "equipment_header_title_provider" = "Supplier:";
    "equipment_header_title_installer" = "Installer:";
    
    "equipment_header_title_contract_fixed" = "Fixed contract";
    "equipment_header_title_contract_maintain" = "Maintenance contract";
    
    
    "asset_paremeter_name" = "Name:";
    "asset_paremeter_default_value" = "Default:";
    "asset_paremeter_unit" = "Unit:";
    "asset_paremeter_desc" = "Description:";
    
    
    "asset_contract_code" = "Code:";
    "asset_contract_guarantor" = "Vendor:";
    "asset_contract_startdate" = "Start Date:";
    "asset_contract_stopdate" = "Due Date:";
    "asset_contract_amount" = "Contract value:";
    "asset_contract_description" = "Description:";
    
    "asset_factory_contact" = "Contact:";
    "asset_factory_phone" = "Phone:";
    "asset_factory_address" = "Address:";
    
    "asset_order_record_applicant" = "Applicant:";
    "asset_order_record_location" = "Location:";
    
    "asset_filter_code" = "Code";
    "asset_filter_base_info" = "Base Info";
    "asset_filter_location" = "Location";
    "asset_filter_classification" = "Classification";
    "asset_filter_status" = "Equipment Status";
    
    "asset_no_match_notice" = "No match equipment, please check again.";
    
    
    "textfield_placeholder_code" = "Type in equipment code";
    "textfield_placeholder_baseinfo" = "Type in name/brand/model";
    "textfield_placeholder_location" = "Type in location";
    "textfield_placeholder_classification" = "Type in classifacition";
    
    
    "asset_record_fixed_none" = "No Fixed Record";
    "asset_record_maintain_none" = "No Maintenance Record";
    "asset_record_contract_none" = "No Contract Data";
    "asset_record_factory_none" = "No Factory Data";
    
    //在岗管理
    "attendance_person_status_in" = "In";
    "attendance_person_status_out" = "Out";
    
    "attendance_navigation_title_sign" = "Attendance";
    "attendance_navigation_title_setting" = "Attendance Setting";
    
    "attendance_tabbar_btn_sign" = "Sign";
    "attendance_tabbar_btn_setting" = "Setting";
    
    "attendance_time_type_sign_IN" = "Sign-In";
    "attendance_time_type_sign_OUT" = "Sign-Out";
    
    "attendance_sign_type_sign_IN" = "Sign-In";
    "attendance_sign_type_sign_OUT" = "Sign-Out";
    
    "attendance_setting_employee" = "Employee";
    "attendance_setting_location" = "Location";
    "attendance_setting_WiFi" = "Wi-Fi";
    "attendance_setting_bluetooth" = "Bluetooth";
    "attendance_setting_status_enable" = "Enable";
    "attendance_setting_status_unable" = "Unable";
    
    "attendance_setting_employee_add" = "Employee Add";
    "attendance_notice_employee_add_empty" = "Please select one more employee.";
    "attendance_notice_employee_add_new" = "Please add new employee.";
    "attendance_notice_no_employee" = "No more employee.";
    "attendance_notice_employee_add_success" = "Employee added successfully.";
    "attendance_notice_employee_add_fail" = "Employee added failed.";
    "attendance_setting_employee_delete_success" = "Employee deleted successfully.";
    "attendance_setting_employee_delete_fail" = "Employee deleted failed.";
    
    "attendance_sign_WiFi_within" = "Within WiFi Range: %@";
    "attendance_sign_BLE_within" = "Within Bluetooth Range: %@";
    "attendance_sign_GPS_within" = "Within GPS Range: %@";
    
    "attendance_sign_leave" = "Within Range";
    "attendance_sign_forbidden" = "Sign Forbidden";
    
    "attendance_sign_fail_in" = "Sign In Failed";
    "attendance_sign_fail_out" = "Sign Out Failed";
    
    "attendance_notice_no_location" = "No more location.";
    "attendance_notice_no_wifi" = "No more wifi.";
    "attendance_notice_no_bluetooth" = "No more bluetooth.";
    
    "attendance_notice_wifi_add_header" = "Some wifi for choice";
    "attendance_notice_wifi_add_empty" = "Please select one more wifi.";
    "attendance_notice_wifi_add_using" = "The current choice is in using, select another one please.";
    "attendance_setting_wifi_add" = "Wi-Fi Add";
    "attendance_setting_wifi_add_success" = "Wi-Fi added successfully.";
    "attendance_setting_wifi_add_fail" = "Wi-Fi added failed.";
    "attendance_setting_wifi_delete_success" = "Wi-Fi deleted successfully.";
    "attendance_setting_wifi_delete_fail" = "Wi-Fi deleted failed.";
    "attendance_setting_wifi_update_success" = "Wi-Fi State Update Success.";
    "attendance_setting_wifi_update_fail" = "Wi-Fi State Update Failed.";
    
    "attendance_notice_bluetooth_add_header" = "Some bluetooth for choice";
    "attendance_notice_bluetooth_add_empty" = "Please select one more bluetooth.";
    "attendance_notice_bluetooth_add_using" = "The current choice is in using, select another one please.";
    "attendance_setting_bluetooth_add" = "Bluetooth Add";
    "attendance_setting_bluetooth_add_success" = "Bluetooth added successfully.";
    "attendance_setting_bluetooth_add_fail" = "Bluetooth added failed.";
    "attendance_setting_bluetooth_delete_success" = "Bluetooth deleted successfully.";
    "attendance_setting_bluetooth_delete_fail" = "Bluetooth deleted failed.";
    
    
    "attendance_setting_location_notice_pick_accuracy" = "Please select a value for accuracy.";
    "attendance_notice_location_add_empty" = "Please add one more location.";
    "attendance_notice_location_add_using" = "The current choice is in using, select another one please.";
    "attendance_setting_location_add" = "Location Add";
    "attendance_setting_location_notice_pick_accuracy" = "Select Accuracy";
    "attendance_setting_location_add_success" = "Location added successfully.";
    "attendance_setting_location_add_fail" = "Location added failed.";
    "attendance_setting_location_delete_success" = "Location deleted successfully.";
    "attendance_setting_location_delete_fail" = "Location deleted failed.";
    
    "attendance_setting_location_update_success" = "Location State Update Success";
    "attendance_setting_location_update_failed" = "Location State Update Failed.";
    
    "attendance_setting_employee_title" = "Employee(%ld)";
    "attendance_setting_location_title" = "Location";
    "attendance_setting_wifi_title" = "WiFi";
    "attendance_setting_bluetooth_title" = "Bluetooth";
    
    "attendance_setting_configuration_enable" = "Enable";
    "attendance_setting_configuration_disable" = "Disable";
    
    "attendance_getting_setting_configuration_fail" = "Sign Setting Request Failed";
    
    "attendance_sign_in" = "In";
    "attendance_sign_out" = "Out";
    
    "attendance_location_fail" = "Failed to locate";
    "attendance_location_search_placeholder" = "Search";
    
    //合同
    "contract_status_undo" = "Created";
    "contract_status_executing" = "In Process";
    "contract_status_expired" = "Expired";
    "contract_status_verfied_NO" = "UnPassed";
    "contract_status_verfied_YES" = "Passed";
    "contract_status_verfied" = "Verified";
    "contract_status_terminated" = "Terminated";
    "contract_status_closed" = "Archived";
    "contract_status_verfied" = "Verified";
    
    "contract_op_status_create" = "Create";
    "contract_op_status_close" = "Terminate";
    "contract_op_status_expired" = "Recovery";
    "contract_op_status_verfied_NO" = "Refuse";
    "contract_op_status_verfied_YES" = "Pass";
    "contract_op_status_archived" = "Archive";
    "contract_op_status_update" = "Update";
    
    "contract_management_title" = "Contract Management";
    
    "contract_operate_pass" = "Pass";
    "contract_operate_unpass" = "UnPass";
    
    "contract_payment_in" = "Cheques";
    "contract_payment_out" = "Payment";
    
    "contract_cost_type_transfer" = "Transfer";
    "contract_cost_type_cash" = "Cash";
    "contract_cost_type_draft" = "Draft";
    
    "contract_filter_header_title_code" = "Contract Code";
    "contract_filter_header_title_code_placeholder" = "Please Enter Code";
    "contract_filter_header_title_cost_type" = "Cost Type";
    "contract_filter_header_title_status" = "Status";
    
    "contract_query_no_data" = "No Data";
    
    "contract_time_life" = "Period:";
    "contract_category" = "Category:";
    
    "contract_detail_request_fail" = "Failed to request contract detail";
    "contract_statistics_request_fail" = "Failed to request contract statistics";
    
    
    "contract_amount_total" = "Total";
    "contract_amount_payment" = "Payment";
    "contract_amount_receivable" = "Receivables";
    
    "contract_currency_type_yuan" = "￥";
    "contract_currency_type_dollar" = "$";
    
    "contract_detail_operate_title" = "Operate";
    "contract_detail_operate_close" = "Terminate";
    "contract_detail_operate_check" = "Check";
    "contract_detail_operate_archived" = "Archived";
    "contract_detail_operate_recovery" = "Recovery";
    
    "contract_detail_operate_title_close" = "Contract Terminate";
    "contract_detail_operate_title_recovery" = "Contract Recovery";
    "contract_detail_operate_title_check" = "Contract Check";
    "contract_detail_operate_title_archived" = "Contract Archived";
    
    "contract_record_detail_title" = "Operation Record";
    "contract_equipment_detail_title" = "Associated Equipment";
    
    "contract_detail_header_title_profile" = "Base Info";
    "contract_detail_header_title_record" = "Operation Record";
    "contract_detail_header_title_equipment" = "Associated Equipment";
    
    "contract_detail_baseinfo_title_name" = "Name：";
    "contract_detail_baseinfo_title_category" = "Category：";
    "contract_detail_baseinfo_title_money" = "Amounts：";
    "contract_detail_baseinfo_title_paymethod" = "Payment method：";
    "contract_detail_baseinfo_title_signdate" = "Sign Date：";
    "contract_detail_baseinfo_title_clerk" = "Clerk：";
    "contract_detail_baseinfo_title_department" = "Department：";
    "contract_detail_baseinfo_title_duedate" = "Expiry Date：";
    "contract_detail_baseinfo_title_partyA" = "Party A：";
    "contract_detail_baseinfo_title_partyACharge" = "Head of Party A：";
    "contract_detail_baseinfo_title_partyB" = "Party B：";
    "contract_detail_baseinfo_title_partyBCharge" = "Head of Party B：";
    "contract_detail_baseinfo_title_content" = "Main content：";
    "contract_detail_baseinfo_title_attachment" = "Attachment：";
    
    "contract_equipment_title_location" = "Location：";
    
    //公告，告示
    "function_notice" = "Bulletin";
    
    "bulletin_notice_read" = "Read";
    "bulletin_notice_unread" = "Unread";
    
    "bulletin_notice_read_count" = "Read(%d)";
    "bulletin_notice_unread_count" = "Unread(%d)";
    
    "bulletin_history_request_failed" = "Failed to request bulletins";
    "bulletin_history_no_data" = "No Data";
    "bulletin_history_no_data_unreaded" = "No Data";
    "bulletin_history_no_data_readed" = "No Data";
    "bulletin_history_creator" = "Creator";
    "bulletin_detail_read_state" = "Read:%ld, Unread:%ld";
    
    "bulletin_top" = "Top";
    
    "bulletin_grade_type_project" = "Project";
    "bulletin_grade_type_company" = "Company";
    "bulletin_grade_type_system" = "System";
    
    "bulletin_detail_no_data" = "Bulletin Failed";
    
    "bulletin_read_unread_list" = "Bulletin Read State";
    "bulletin_reader_no_data" = "No Data";
}


